Revit 2027 API
FootPrintRoof.SlopeAngle Property
Retrieve or set the SlopeAngle of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double this[
	ModelCurve pCurve
] { get; set; }
Public Property SlopeAngle (
	pCurve As ModelCurve
) As Double
	Get
	Set
public:
property double SlopeAngle[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
member SlopeAngle : float with get, set
Parameters
pCurve ModelCurve
Property Value
Double
Remarks
The value is a "slope" measurement. For example, 0.5 is one unit of rise for each 2 units of run. This creates a slope of 26.57 degrees (the arctangent of 0.5).
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace